Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH00/atdf/PIC32CM2532JH00064.atdf
        <register name="ECCCTRL" offset="0x80" rw="RW" size="2" initval="0x0000" caption="ECC control">
          <bitfield name="ECCDIS" caption="FLASH ECC Disable" mask="0x1" values="NVMCTRL_ECCCTRL__ECCDIS"/>
          <bitfield name="ECCDFDIS" caption="Data Flash ECC Disable" mask="0x2" values="NVMCTRL_ECCCTRL__ECCDFDIS"/>
          <bitfield name="SECCNT" caption="Flash SEC Count" mask="0xFF00"/>
        </register>
        <register name="FLTCTRL" offset="0x84" rw="RW" size="2" initval="0x0000" caption="Fault injection control">
          <bitfield name="FLTRST" caption="Fault reset" mask="0x1" values="NVMCTRL_FLTCTRL__FLTRST"/>
          <bitfield name="FLTEN" caption="Fault Injection Enabled" mask="0x2" values="NVMCTRL_FLTCTRL__FLTEN"/>
          <bitfield name="FLTMD" caption="Fault Mode Control" mask="0x7000" values="NVMCTRL_FLTCTRL__FLTMD"/>
        </register>
        <register name="FFLTPTR" offset="0x88" rw="RW" size="4" initval="0x00000000" caption="Fault injection pointer">
          <bitfield name="FLT1PTR" caption="Fault Injection Pointer 1" mask="0xFF"/>
          <bitfield name="FLT2PTR" caption="Fault Injection pointer 2" mask="0xFF0000"/>
        </register>
        <register name="FFLTADR" offset="0x8C" rw="RW" size="4" initval="0x00000000" caption="Fault injection address">
          <bitfield name="FLTADR" caption="Fault Injection Address" mask="0xFFFFFF"/>
        </register>
        <register name="FFLTCAP" offset="0x90" rw="R" size="4" initval="0x00000000" caption="Fault error capture addr">
          <bitfield name="FLTADR" caption="Fault Capture Address" mask="0xFFFFFF"/>
        </register>
        <register name="FFLTPAR" offset="0x94" rw="R" size="4" initval="0x00000000" caption="Fault parity">
          <bitfield name="SECIN" caption="Single Error Parity Bits" mask="0xFF"/>
          <bitfield name="SECOUT" caption="The Calculated Single Error Parity Bits" mask="0xFF0000"/>
        </register>
        <register name="FFLTSYN" offset="0x98" rw="R" size="4" initval="0x00000000" caption="Fault ECC syndrome">
          <bitfield name="SECSYN" caption="Single Error Syndrome" mask="0xFF"/>
          <bitfield name="DERRSERR" caption="Double Error detected, Single error corrected" mask="0x30000"/>
        </register>
        <register name="DBGCTRL" offset="0x9C" rw="RW" size="1" initval="0x00" caption="Debug control">
          <bitfield name="DBGECC" caption="ECC errors from debugger reads are" mask="0x6" values="NVMCTRL_DBGCTRL__DBGECC"/>
        </register>
      </register-group>
      <value-group name="NVMCTRL_CTRLA__CMD">
        <value name="ER" caption="Erase Row - Erases the row addressed by the ADDR register." value="0x02"/>
        <value name="WP" caption="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x04"/>
        <value name="EAR" caption="Erase Auxiliary Row - Erases the auxiliary row addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row." value="0x05"/>
        <value name="WAP" caption="Write Auxiliary Page - Writes the contents of the page buffer to the page addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row." value="0x06"/>
        <value name="SF" caption="Security Flow Command" value="0x0A"/>
        <value name="WL" caption="Write lockbits" value="0x0F"/>
        <value name="DFER" caption="Data Flash Erase Row - Erases the row addressed by the ADDR register." value="0x1A"/>
        <value name="DFWP" caption="Data Flash Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x1C"/>
        <value name="LR" caption="Lock Region - Locks the region containing the address location in the ADDR register." value="0x40"/>
        <value name="UR" caption="Unlock Region - Unlocks the region containing the address location in the ADDR register." value="0x41"/>
        <value name="SPRM" caption="Sets the power reduction mode." value="0x42"/>
        <value name="CPRM" caption="Clears the power reduction mode." value="0x43"/>
        <value name="PBC" caption="Page Buffer Clear - Clears the page buffer." value="0x44"/>
        <value name="SSB" caption="Set Security Bit - Sets the security bit by writing 0x00 to the first byte in the lockbit row." value="0x45"/>
        <value name="INVALL" caption="Invalidate all cache lines." value="0x46"/>
        <value name="SCEHL" caption="Set Chip Erase Hard Lock (SCEHL) flash controller command" value="0x7f"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLA__CMDEX">
        <value name="KEY" caption="Execution Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__CACHEDIS">
        <value name="CACHE_DF_DIS_MAIN_EN" caption="The Data Flash cache is disabled, the main array cache is enabled" value="0x0"/>
        <value name="CACHE_DF_DIS_MAIN_DIS" caption="The Data Flash cache is disabled, the main array cache is disabled" value="0x1"/>
        <value name="CACHE_DF_EN_MAIN_EN" caption="The Data Flash cache is enabled, the main array cache is enabled" value="0x2"/>
        <value name="CACHE_DF_EN_MAIN_DIS" caption="The Data Flash cache is enabled, the main array cache is disabled" value="0x3"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__READMODE">
        <value name="NO_MISS_PENALTY" caption="The NVM Controller (cache system) does not insert wait states on a cache miss. Gives the best system performance." value="0x0"/>
        <value name="LOW_POWER" caption="Reduces power consumption of the cache system, but inserts a wait state each time there is a cache miss. This mode may not be relevant if CPU performance is required, as the application will be stalled and may lead to increase run time." value="0x1"/>
        <value name="DETERMINISTIC" caption="The cache system ensures that a cache hit or miss takes the same amount of time, determined by the number of programmed flash wait states. This mode can be used for real-time applications that require deterministic execution timings." value="0x2"/>
      </value-group>
